0/epsilon
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	epsilon;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 2 -3 0 0 0 0];
internalField	uniform 1;
boundaryField
{
	outlet
	{
		type	zeroGradient;
	}
	left
	{
		type	cyclicAMI;
	}
	right
	{
		type	cyclicAMI;
	}
	inlet
	{
		type	turbulentMixingLengthDissipationRateInlet;
		value	uniform 1;
		mixingLength	0.001;
	}
	propeller
	{
		type	epsilonWallFunction;
		value	uniform 1;
	}
	external
	{
		type	turbulentMixingLengthDissipationRateInlet;
		value	uniform 1;
		mixingLength	0.001;
	}
}
